[
  {
    "id": "rp-template",
    "title": "Role Passport Template",
    "description": "Standard template for structuring role requirements from intake.",
    "category": "role-passport",
    "stage": 1,
    "stageLabel": "Stage 1: Intake & Role Passport",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-15",
    "content": "## Role Passport\n\n### Role Title\n[Enter the exact title as discussed with the hiring manager. Include level if applicable, e.g., Senior Software Engineer, L5.]\n\n### Department\n[Business unit, team name, and reporting line. Note the hiring manager name and their title.]\n\n### Location Reality\n[Specify: Fully remote / Hybrid (days in office) / On-site. Include city, office address, and any travel requirements. Note timezone expectations for remote roles.]\n\n### Compensation Range\n[Base salary range (min-max), bonus structure, equity/RSU if applicable, and any sign-on bonus flexibility. Note if the range is firm or has flexibility for exceptional candidates.]\n\n### Must-Haves (Evidence Required)\n1. [Requirement] -- Evidence: [What proof looks like in a screen]\n2. [Requirement] -- Evidence: [What proof looks like in a screen]\n3. [Requirement] -- Evidence: [What proof looks like in a screen]\n4. [Requirement] -- Evidence: [What proof looks like in a screen]\n5. [Requirement] -- Evidence: [What proof looks like in a screen]\n\n### Dealbreakers\n- [Non-negotiable constraint, e.g., must have active security clearance]\n- [Non-negotiable constraint, e.g., cannot sponsor visa]\n\n### Key Motivators\n[What would make an A-player want this role? Mission, craft challenge, career trajectory, compensation, team culture. Rank the top 3 pull factors.]\n\n### Nice-to-Haves\n- [Preferred but not required skill or experience]\n- [Preferred but not required skill or experience]\n\n### Clarifications Needed\n- [Open question for HM follow-up]\n- [Ambiguity that needs resolution before sourcing begins]",
    "usageCount": 47
  },
  {
    "id": "sp-template",
    "title": "Sourcing Plan One-Pager",
    "description": "4-lane sourcing strategy template with target companies and evidence markers.",
    "category": "sourcing-plan",
    "stage": 4,
    "stageLabel": "Stage 4: Sourcing Blueprint",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-15",
    "content": "## Sourcing Plan One-Pager\n\n### Role Summary\n[Role title, level, team, location, comp range. One-line summary of what makes this role unique.]\n\n### Lane 1: Primary Targets\n**Companies:** [List 5-8 target companies where ideal candidates currently work]\n**Titles to Search:** [Exact titles and title variations to use in Boolean searches]\n**Why This Lane:** [What makes these candidates strong matches based on Role Passport must-haves]\n**Evidence Markers:** [What to look for on profiles that signals they meet requirements]\n**Outreach Angle:** Mission-driven or craft-driven depending on company culture\n\n### Lane 2: Adjacent Industries\n**Industries:** [2-3 adjacent industries where transferable skills exist]\n**Companies:** [3-5 companies in these industries]\n**Titles to Search:** [Equivalent titles in adjacent industries]\n**Why This Lane:** [Specific transferable skills and how they map to the role]\n**Evidence Markers:** [Portfolio items, certifications, or project types to look for]\n**Outreach Angle:** Career growth narrative, new challenge framing\n\n### Lane 3: Emerging Talent\n**Sources:** [Bootcamps, open-source communities, conference speakers, blog authors]\n**Signals:** [GitHub contributions, published work, community leadership]\n**Why This Lane:** [High-potential candidates who may lack traditional pedigree but show proof of skill]\n**Evidence Markers:** [Concrete output, side projects, speaking engagements]\n**Outreach Angle:** Craft mastery and learning opportunity\n\n### Lane 4: Passive Channels\n**Channels:** [Referrals, alumni networks, Slack communities, niche job boards]\n**Strategy:** [How to activate each channel, who to ask, what to post]\n**Why This Lane:** [Reach candidates not actively looking but open to the right opportunity]\n**Evidence Markers:** [Warm introductions, community reputation]\n**Outreach Angle:** Personalized based on referral context\n\n### Red Flags to Watch\n- [Job-hopping pattern without progression]\n- [Profile claims without supporting evidence]\n- [Mismatch between stated experience and actual output]",
    "usageCount": 38
  },
  {
    "id": "tc-script",
    "title": "Truth Check Script (General)",
    "description": "Standard 5-question screening script for any role type.",
    "category": "truth-check",
    "stage": 6,
    "stageLabel": "Stage 6: Recruiter Screen",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-20",
    "content": "## Truth Check Script -- General\n\n### Before You Begin\nReview the Role Passport and identify the top 3 must-haves you need to verify. This script provides the framework; adapt the specifics to the role.\n\n### Question 1: Evidence (Recent Impact)\n\"Walk me through the most impactful project you worked on in the last 18 months. What was your specific role, and what was the measurable outcome?\"\n\n**Scoring:**\n- **Strong:** Names a specific project, clearly defines their contribution vs. team effort, provides a quantifiable result (revenue, efficiency, scale). Uses concrete numbers.\n- **OK:** Describes a project with some specifics but struggles to isolate their individual contribution. Outcome is stated but not measured.\n- **Risk:** Gives a vague or generic answer. Cannot name specific outcomes. Attributes everything to \"we\" without clarifying their role.\n\n### Question 2: Evidence (Skill Depth)\n\"Tell me about a time you had to solve a problem where the standard approach did not work. What did you do differently?\"\n\n**Scoring:**\n- **Strong:** Describes a genuine constraint, explains their reasoning process, details the non-obvious solution, and shares the result. Shows depth of thinking.\n- **OK:** Provides an example but the problem was routine. Solution was reasonable but not distinctive.\n- **Risk:** Cannot provide a specific example. Answers in hypotheticals or generalities.\n\n### Question 3: Evidence (Relevant Experience)\n\"What experience do you have with [specific must-have from Role Passport]? Give me a concrete example.\"\n\n**Scoring:**\n- **Strong:** Direct, recent experience with specific tooling, methodology, or domain. Provides context, action, and result.\n- **OK:** Related experience but not a direct match. Demonstrates ability to learn and adapt.\n- **Risk:** No relevant experience. Claims familiarity but cannot substantiate with an example.\n\n### Question 4: Constraint Check\n\"This role requires [location/travel/schedule/comp range]. Does that work for your situation?\"\n\n**Scoring:**\n- **Strong:** Confirmed aligned, no hesitation, already considered this.\n- **OK:** Minor flexibility needed (e.g., needs 1 month to relocate) but fundamentally workable.\n- **Risk:** Clear blocker identified (e.g., cannot meet location requirement, comp expectations significantly exceed range).\n\n### Question 5: Motivation\n\"What specifically about this opportunity interests you, and what would need to be true for you to accept an offer?\"\n\n**Scoring:**\n- **Strong:** Genuine pull factors articulated (mission, craft, team, growth). Can name specific decision criteria. Shows they have done their research.\n- **OK:** Generic interest (\"looking for a new challenge\"). Some alignment but not deeply considered.\n- **Risk:** Push-only motivation (leaving current role, not drawn to this one). No specific interest in this company or role. Focused entirely on compensation.",
    "usageCount": 62
  },
  {
    "id": "tc-rubric",
    "title": "Truth Check Scoring Rubric",
    "description": "Calibration guide for consistent scoring across the team.",
    "category": "truth-check",
    "stage": 6,
    "stageLabel": "Stage 6: Recruiter Screen",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-20",
    "content": "## Truth Check Scoring Rubric\n\n### Purpose\nThis rubric ensures consistent scoring across all recruiters. Use it during calibration sessions and as a reference when scoring screens. The goal is evidence-based assessment, not gut feeling.\n\n### Evidence Scoring (Questions 1-3)\n\n**Strong Signal**\n- Candidate provides a specific, measurable outcome (numbers, percentages, scale)\n- Clearly distinguishes their individual contribution from team effort\n- Example is recent (within 18 months) and relevant to the target role\n- Demonstrates depth of understanding, not just surface-level involvement\n- Can answer follow-up questions with additional detail\n- Example: \"I led the migration of 2.3M user accounts to the new auth system, reducing login failures by 40% over 3 months.\"\n\n**OK Signal**\n- Candidate provides a general answer with some specifics but lacks precision\n- Can describe what they did but struggles to quantify impact\n- Example may be older or only partially relevant\n- Shows competence but not distinction\n- Example: \"I worked on the authentication migration project and helped improve the login experience.\"\n\n**Risk Signal**\n- Vague answers with no supporting evidence\n- Cannot provide a specific example when pressed\n- Relies on hypotheticals (\"I would...\") instead of actuals (\"I did...\")\n- Attributes all outcomes to the team without personal accountability\n- Example: \"We did a lot of great work improving the platform.\"\n\n### Constraint Scoring (Question 4)\n\n**Strong:** Confirmed fully aligned. No adjustments needed. Candidate has already considered the logistics.\n**OK:** Minor flexibility required but fundamentally workable. Timeline is reasonable (under 30 days to resolve).\n**Risk:** Clear blocker identified. Gap between candidate expectations and role reality is significant. Proceeding would waste everyone's time.\n\n### Motivation Scoring (Question 5)\n\n**Strong:** Genuine pull to this specific role and company. Can articulate why this over other options. Decision criteria are clear and achievable.\n**OK:** General interest, some alignment. Has not deeply researched the opportunity but shows openness.\n**Risk:** Push-only motivation. Leaving a bad situation rather than moving toward something specific. No differentiated interest in this role.\n\n### Overall Recommendation Framework\n- **3+ Strong signals:** Advance with high confidence\n- **2 Strong + no Risk:** Advance with notes on development areas\n- **1 Risk in Constraints:** Flag to HM before advancing\n- **2+ Risk signals:** Do not advance. Document reasoning.",
    "usageCount": 41
  },
  {
    "id": "cp-format",
    "title": "Confidence Pack Format",
    "description": "Evidence-based candidate submission template for hiring managers.",
    "category": "confidence-pack",
    "stage": 7,
    "stageLabel": "Stage 7: Submission & HM Prep",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-25",
    "content": "## Confidence Pack\n\n### Candidate Overview\n**Name:** [Full name]\n**Current Title:** [Title] @ [Company]\n**Location:** [City, State/Country]\n**Target Role:** [Role title being submitted for]\n\n### Why This Candidate (Evidence-Based Match)\n\n**Match Reason 1: [Must-Have from Role Passport]**\nEvidence: [Specific example from the Truth Check screen. Include what they said, the outcome they achieved, and why it maps directly to this requirement. Use their words where powerful.]\n\n**Match Reason 2: [Must-Have from Role Passport]**\nEvidence: [Same structure. Concrete proof point, not interpretation. What did they do, what was the result, how does it apply here.]\n\n**Match Reason 3: [Must-Have or Differentiator]**\nEvidence: [This can be a must-have match or something that sets them apart. A unique strength, relevant domain expertise, or a pattern of impact that signals high performance in this role.]\n\n### Risk to Know\n**Risk:** [Be transparent. Identify the one area of concern: skill gap, tenure pattern, constraint, or motivation question mark.]\n**Mitigation:** [How this risk can be addressed. Is it testable in the interview? Is it a manageable ramp-up? Has the candidate acknowledged it?]\n\n### Constraint Check Summary\n- **Compensation:** [Aligned / Needs discussion -- specifics]\n- **Location:** [Confirmed / Needs flexibility]\n- **Timeline:** [Available in X weeks / Notice period details]\n- **Other:** [Visa, non-compete, travel, etc.]\n\n### Recommended Next Step\n[Specific recommendation: e.g., \"Schedule a 45-minute technical deep-dive focusing on system design and the migration experience described above.\"]\n\n### Suggested Interview Focus\n- [Area 1 to probe: tied to match reason or risk]\n- [Area 2 to probe: skill or experience to validate]\n- [Area 3 to probe: cultural or motivational alignment]",
    "usageCount": 55
  },
  {
    "id": "outreach-mission",
    "title": "Outreach Template: Mission Hook",
    "description": "Outreach angle focusing on mission, impact, and purpose.",
    "category": "outreach",
    "stage": 5,
    "stageLabel": "Stage 5: Outreach & Engagement",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-02-01",
    "content": "## Outreach Template: Mission Hook\n**Angle Code: A -- Mission & Impact**\n\n### When to Use\nUse this angle when the company has a compelling mission, the role has visible real-world impact, or the candidate's profile suggests values-driven career decisions (nonprofit experience, mission statements on LinkedIn, community involvement).\n\n### Subject Line Options\n- \"The impact behind [Company]'s next [Role Title]\"\n- \"[Candidate First Name], this one's about the mission\"\n- \"What [Company] is building -- and why it matters\"\n\n### Initial Message (Under 100 Words)\nHi [First Name],\n\nI came across your work at [Current Company] and was struck by [specific observation from their profile]. At [Company], we are working on [one-sentence mission description that connects to real-world impact]. We are looking for a [Role Title] who can [specific contribution tied to mission]. The work directly affects [concrete impact: number of users, communities served, systems improved]. I would welcome the chance to share more about how this role connects to that bigger picture. Worth a conversation?\n\n### Follow-up 1 (Day 4 -- Different Value, Same Angle)\nHi [First Name],\n\nQuick follow-up. I wanted to share that [recent company milestone, press mention, or impact stat] to give you a sense of the momentum here. The [Role Title] role is central to [specific initiative]. If the mission resonates, I would be glad to connect you with [team lead or peer] who can speak to the day-to-day impact. Let me know if you are open to a brief call.\n\n### Follow-up 2 (Day 8 -- Respectful Close)\nHi [First Name],\n\nI understand timing may not be right, and I respect that. If [Company]'s mission to [one-line mission] ever aligns with where you are headed, my door is open. Wishing you continued success at [Current Company].",
    "usageCount": 33
  },
  {
    "id": "outreach-craft",
    "title": "Outreach Template: Craft Hook",
    "description": "Outreach angle focusing on technical mastery and craft challenge.",
    "category": "outreach",
    "stage": 5,
    "stageLabel": "Stage 5: Outreach & Engagement",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-02-01",
    "content": "## Outreach Template: Craft Hook\n**Angle Code: B -- Technical Mastery & Craft Challenge**\n\n### When to Use\nUse this angle when the role involves deep technical work, the candidate has a strong craft identity (open-source contributions, technical blog posts, conference talks), or the team and tech stack are the primary draw.\n\n### Subject Line Options\n- \"The [technical challenge] we are solving at [Company]\"\n- \"[First Name], a craft-level problem worth your time\"\n- \"Building [specific system] from the ground up\"\n\n### Initial Message (Under 100 Words)\nHi [First Name],\n\nYour work on [specific project, repo, or talk] caught my attention -- particularly [specific technical detail that shows you actually reviewed their work]. At [Company], we are tackling [specific technical challenge: scale, architecture decision, greenfield build]. The [Role Title] role owns [specific technical scope] and works with a team that includes [notable peers or tech leads, if applicable]. The stack is [relevant technologies], and the problem space requires [key technical skill]. If solving hard problems at this level interests you, I would welcome the chance to share the technical details.\n\n### Follow-up 1 (Day 4 -- Technical Depth)\nHi [First Name],\n\nFollowing up with a bit more context. The core challenge for this role involves [specific technical problem: latency at scale, data pipeline architecture, ML model serving, etc.]. Our current approach is [brief technical context], and we need someone who can [specific craft contribution]. Happy to connect you with [engineering lead] for a technical conversation, no strings attached. Sometimes the best way to evaluate an opportunity is engineer-to-engineer.\n\n### Follow-up 2 (Day 8 -- Respectful Close)\nHi [First Name],\n\nI will keep this brief. If the technical challenge at [Company] interests you down the road, I am here. Meanwhile, I genuinely enjoyed reviewing your work on [specific reference]. Keep building great things.",
    "usageCount": 29
  },
  {
    "id": "outreach-career",
    "title": "Outreach Template: Career Hook",
    "description": "Outreach angle focusing on career trajectory and growth.",
    "category": "outreach",
    "stage": 5,
    "stageLabel": "Stage 5: Outreach & Engagement",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-02-01",
    "content": "## Outreach Template: Career Hook\n**Angle Code: C -- Career Trajectory & Growth**\n\n### When to Use\nUse this angle when the role represents a clear step up (title, scope, team size), the candidate appears ready for the next level based on their trajectory, or the company offers unique development opportunities (mentorship, exposure, scale jump).\n\n### Subject Line Options\n- \"Your next step after [Current Company]\"\n- \"[First Name], a role built for where you are headed\"\n- \"From [current level] to [next level] at [Company]\"\n\n### Initial Message (Under 100 Words)\nHi [First Name],\n\nLooking at your path from [previous role/company] to [current role/company], the trajectory is clear -- you are building toward [inferred career goal based on their progression]. At [Company], we have a [Role Title] role that could be the next chapter: [specific growth dimension -- larger team, broader scope, new domain, leadership opportunity]. You would be stepping into [specific opportunity] with [support structure: mentorship, resources, autonomy]. If your next move is about accelerating that trajectory, I think this is worth exploring. Open to a conversation?\n\n### Follow-up 1 (Day 4 -- Growth Evidence)\nHi [First Name],\n\nQuick follow-up with some context on the growth story here. In the last [timeframe], the team has [growth metric: scaled from X to Y, launched new product line, expanded to new markets]. The [Role Title] role was created because [specific reason that signals opportunity, not backfill]. Recent hires in similar roles have gone on to [progression example]. If career trajectory matters to your next decision, happy to share more.\n\n### Follow-up 2 (Day 8 -- Respectful Close)\nHi [First Name],\n\nI respect that you may not be looking right now. Your career progression speaks for itself, and the right opportunity will find you when the timing is right. If [Company] ever comes up on your radar, I would be glad to reconnect. All the best.",
    "usageCount": 25
  },
  {
    "id": "tradeoff-timeline",
    "title": "Trade-off Playbook: Tight Timeline",
    "description": "How to propose adjustments when the timeline is unrealistic.",
    "category": "trade-off",
    "stage": null,
    "stageLabel": null,
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-28",
    "content": "## Trade-off Playbook: Tight Timeline\n\n### Situation\nThe hiring manager has set a fill deadline that does not align with market reality for the role's requirements, compensation, or location. Proceeding without adjustment will result in either a bad hire or a missed deadline.\n\n### The Three Options to Present\n\n**Option 1: Reduce Requirements**\nAdjust the must-have list to broaden the candidate pool. Identify which requirements are truly non-negotiable vs. which are trainable. Frame as: \"If we move [requirement] from must-have to nice-to-have, we can access 3x more candidates and likely fill within your timeline.\"\n**Best for:** Roles where some skills can be developed on the job.\n**How to Frame:** \"I want to hit your timeline. Here is what the market is showing us: [data]. If we flex on [specific requirement], I am confident we can present strong candidates within [realistic timeframe].\"\n\n**Option 2: Increase Compensation**\nRaise the comp range to attract candidates who are currently employed and not actively looking. Frame as: \"The candidates who meet all requirements at this level are earning [market data]. To pull them, we need to be at [adjusted range].\"\n**Best for:** Roles where all requirements are genuinely critical.\n**How to Frame:** \"The talent that meets every must-have exists, but they are well-compensated. Market data shows [range]. If we adjust to [new range], we can move faster because we are competitive on first contact.\"\n\n**Option 3: Extend Timeline**\nSet a realistic timeline based on market data and pipeline projections. Frame as: \"Based on similar roles we have filled, the realistic timeline is [X weeks]. Here is the pipeline build plan.\"\n**Best for:** Roles where requirements and comp are firm.\n**How to Frame:** \"I want to set expectations we can beat, not miss. For a role at this level with these requirements in [location], our data shows [realistic timeline]. Here is the weekly plan to get there.\"\n\n### Recommended Approach\nAlways lead with data, not opinion. Present all three options and let the HM choose. Position yourself as the strategic advisor, not the order-taker. Document the decision for accountability.",
    "usageCount": 18
  },
  {
    "id": "tradeoff-comp",
    "title": "Trade-off Playbook: Comp Mismatch",
    "description": "How to address when compensation doesn't match market reality.",
    "category": "trade-off",
    "stage": null,
    "stageLabel": null,
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-28",
    "content": "## Trade-off Playbook: Comp Mismatch\n\n### Situation\nThe approved compensation range is below what the market demands for the required skill set, experience level, and location. Candidates are either declining to engage or dropping out after learning the range.\n\n### Market Data Framing\nBefore presenting options, gather and present evidence:\n- Salary data from 2-3 sources (levels.fyi, Glassdoor, Radford, internal benchmarks)\n- Competitor comp ranges for similar roles (anonymized if needed)\n- Candidate feedback quotes: \"I had 3 candidates decline after hearing the range. Their feedback was...\"\n- Pipeline impact: \"At current range, we are seeing a [X%] response rate vs. [Y%] for roles priced at market.\"\n\n### The Three Options to Present\n\n**Option 1: Adjust Base Range to Market**\nIncrease the base salary range to match the 50th-75th percentile for the role in the target market. Frame as: \"Aligning to market does not mean overpaying. It means we are competitive on first contact and do not lose candidates to offers we could have matched.\"\n**How to Present:** \"Here is the data. [Source 1] shows [range]. [Source 2] shows [range]. Our current range of [X] puts us at the [percentile]. Moving to [Y] puts us at competitive. The cost difference is [amount], and the cost of an unfilled role for another [weeks] is [estimated impact].\"\n\n**Option 2: Restructure Total Compensation**\nKeep base within budget but add signing bonus, equity, or accelerated review timeline. Frame as: \"We can be creative with the package to meet candidate expectations without changing the base band.\"\n**How to Present:** \"If the base range is firm, we can bridge the gap with [specific lever]. Candidates value total comp. A [signing bonus / equity grant / 6-month review] can make the overall package competitive.\"\n\n**Option 3: Adjust the Profile**\nTarget a less experienced hire at the current range and invest in development. Frame as: \"At this range, we can attract strong [junior/mid] candidates and grow them into the role within [timeframe].\"\n**How to Present:** \"The current range aligns with [lower level] talent. We can hire a high-potential candidate at this level and invest in a 6-month development plan. The trade-off is ramp time vs. immediate impact.\"\n\n### Key Principle\nNever blame HR, finance, or policy. Present the market reality and let the data drive the conversation. Your role is to surface the trade-off, not to approve the budget.",
    "usageCount": 22
  },
  {
    "id": "tradeoff-location",
    "title": "Trade-off Playbook: Location Constraints",
    "description": "How to navigate location requirements vs talent availability.",
    "category": "trade-off",
    "stage": null,
    "stageLabel": null,
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-28",
    "content": "## Trade-off Playbook: Location Constraints\n\n### Situation\nThe role requires a specific location (office-based, hybrid, or geo-restricted) that significantly limits the available talent pool. The candidates who meet the skill requirements are concentrated in different markets, or top candidates are declining due to location rigidity.\n\n### Data to Gather First\n- Total addressable talent pool in required location vs. expanded geography\n- Number of candidates who met criteria but declined due to location\n- Competitor location policies for similar roles\n- Team collaboration patterns: how often is in-person interaction genuinely necessary?\n\n### The Three Options to Present\n\n**Option 1: Expand to Hybrid or Remote**\nOpen the role to remote or hybrid with periodic on-site requirements. Frame as: \"Expanding to [hybrid/remote] increases our talent pool from [X] to [Y] candidates in the target profile. We can require [quarterly/monthly] on-site presence for key collaboration.\"\n**How to Present:** \"The data shows [X] qualified candidates in [required city] vs. [Y] if we expand to [region/remote]. Teams at [competitor examples] have moved to hybrid for this role type. We could structure it as [specific hybrid model] to maintain collaboration while accessing better talent.\"\n\n**Option 2: Increase Relocation Support**\nKeep the location requirement but offer relocation packages to attract candidates willing to move. Frame as: \"The talent exists in [other markets]. With a relocation package of [estimated cost], we can access [X] additional candidates.\"\n**How to Present:** \"I have identified [X] strong candidates in [other cities] who meet every must-have. [Y] of them indicated openness to relocation with support. The relocation investment of [cost] compares favorably to the cost of the role remaining unfilled.\"\n\n**Option 3: Accept Longer Timeline**\nKeep strict location requirements but acknowledge the reduced pool means a longer search. Frame as: \"We can absolutely fill this role in [location] with all requirements. The realistic timeline is [extended estimate] based on the addressable pool of [X] candidates.\"\n**How to Present:** \"In [location], there are approximately [X] candidates who match this profile. At our typical conversion rates, we need to engage [Y] to yield [Z] qualified candidates. That timeline looks like [realistic estimate].\"\n\n### Key Principle\nDo not assume the location requirement is arbitrary. Ask the HM: \"What would break if this person were not in [location] every day?\" Often the answer reveals flexibility that was not initially offered. If the reason is genuine, respect it and adjust the plan accordingly.",
    "usageCount": 15
  },
  {
    "id": "std-quality",
    "title": "What Good Looks Like: Quality Standard",
    "description": "Team definition of quality based on the 5 Proof Points.",
    "category": "standards",
    "stage": null,
    "stageLabel": null,
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-10",
    "content": "## What Good Looks Like: The 5 Quality Proof Points\n\n### Purpose\nThis document defines what quality means for our recruiting practice. Every candidate interaction, submission, and process step should be measured against these five proof points.\n\n### Proof Point 1: Evidence Over Assumption\n**Definition:** Every candidate assessment is backed by specific, verifiable evidence from direct conversation or observable output. No assumptions, no vibes, no pattern-matching on resume keywords.\n**Strong Example:** \"Candidate described leading a team of 8 through a platform migration that reduced API latency by 35%. They personally architected the caching layer and can diagram the before/after.\"\n**Weak Example:** \"Candidate has 10 years of experience at top companies. Seems very senior and capable.\"\n\n### Proof Point 2: Constraint Clarity\n**Definition:** All logistical, financial, and personal constraints are identified and confirmed before a candidate advances. No surprises at offer stage.\n**Strong Example:** \"Confirmed: candidate requires $180-195K base, can start in 3 weeks, prefers hybrid 3 days/week, has no non-compete concerns. Documented in screen notes.\"\n**Weak Example:** \"Candidate seems flexible on comp and logistics. We can figure out the details later.\"\n\n### Proof Point 3: Motivation Depth\n**Definition:** We understand not just whether a candidate is interested, but specifically why they want this role at this company at this time. Pull factors are identified and genuine.\n**Strong Example:** \"Candidate is drawn to the company's approach to developer tooling. They referenced our recent blog post on build performance and said it aligns with the direction they want to take their career.\"\n**Weak Example:** \"Candidate is interested in the role and open to learning more.\"\n\n### Proof Point 4: Process Transparency\n**Definition:** Hiring managers, candidates, and stakeholders know exactly where things stand at all times. No information gaps, no stale updates, no surprises.\n**Strong Example:** \"Sent HM weekly update with pipeline status, screen outcomes, and recommended next steps. Candidate received timeline confirmation within 24 hours of screen.\"\n**Weak Example:** \"HM asked for an update. Need to check where things stand.\"\n\n### Proof Point 5: Learning Integration\n**Definition:** Every closed role (filled or not) generates at least one documented insight that improves future performance. Mistakes are examined, wins are understood, and patterns are shared.\n**Strong Example:** \"Postmortem revealed that 60% of rejected candidates were screened out for a requirement that was later dropped. Updated the intake process to flag requirements that have been relaxed in past searches.\"\n**Weak Example:** \"Role is closed. Moving on to the next one.\"",
    "usageCount": 70
  },
  {
    "id": "std-screen-notes",
    "title": "Screen Notes Standard Format",
    "description": "How to structure screen notes: evidence vs interpretation.",
    "category": "standards",
    "stage": 6,
    "stageLabel": "Stage 6: Recruiter Screen",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-01-22",
    "content": "## Screen Notes Standard Format\n\n### Purpose\nScreen notes are the foundation of every downstream decision. They must separate what the candidate said (evidence) from what you think it means (interpretation). This format ensures consistency and makes Confidence Packs easier to build.\n\n### Evidence Summary\n\n**Area 1: [Must-Have from Role Passport]**\n- **What they said:** [Direct quote or close paraphrase of the candidate's response]\n- **What it suggests:** [Your interpretation of how this maps to the requirement]\n- **Confidence level:** Strong / OK / Risk\n- **Follow-up needed:** [Any probe that would strengthen the assessment]\n\n**Area 2: [Must-Have from Role Passport]**\n- **What they said:** [Direct quote or close paraphrase]\n- **What it suggests:** [Your interpretation]\n- **Confidence level:** Strong / OK / Risk\n- **Follow-up needed:** [Any remaining questions]\n\n**Area 3: [Must-Have from Role Passport]**\n- **What they said:** [Direct quote or close paraphrase]\n- **What it suggests:** [Your interpretation]\n- **Confidence level:** Strong / OK / Risk\n- **Follow-up needed:** [Any remaining questions]\n\n### Constraint Check\n- **Compensation:** [Candidate's stated expectations vs. role range. Note: aligned / gap / flexible]\n- **Location:** [Confirmed alignment or constraints noted]\n- **Timeline:** [Availability, notice period, start date flexibility]\n- **Other constraints:** [Visa, non-compete, travel, schedule, etc.]\n\n### Motivation Assessment\n- **Pull factors:** [What specifically attracts them to this role/company]\n- **Push factors:** [What is driving them away from current situation]\n- **Decision criteria:** [What they said would need to be true to accept an offer]\n- **Motivation confidence:** Strong / OK / Risk\n\n### Overall Recommendation\n**Recommendation:** Advance / Hold / Pass\n**Rationale:** [2-3 sentences summarizing why, referencing the evidence above]\n**If advancing:** [What the next interviewer should probe or validate]\n**If passing:** [Specific reason with evidence, respectful and documentable]",
    "usageCount": 44
  },
  {
    "id": "auto-followup",
    "title": "Automated Follow-up Sequence",
    "description": "3-touch follow-up sequence with timing and escalation rules.",
    "category": "automation",
    "stage": 5,
    "stageLabel": "Stage 5: Outreach & Engagement",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-02-01",
    "content": "## Automated Follow-up Sequence\n\n### Overview\nThis sequence governs candidate follow-up after initial outreach. It applies to all outreach angles (Mission, Craft, Career) and ensures consistent, respectful persistence without spam.\n\n### Touch 1: Initial Outreach (Day 0)\n**Channel:** LinkedIn InMail or Email (based on channel strategy)\n**Content:** Use the appropriate outreach template (Angle A, B, or C)\n**Personalization required:** Minimum 2 specific references to the candidate's profile or work\n**Send time:** Tuesday-Thursday, 8-10 AM candidate's local time\n**Tracking:** Log in ATS with outreach angle code and template version\n\n### Touch 2: Value-Add Follow-up (Day 4)\n**Channel:** Same channel as Touch 1\n**Content:** Follow-up 1 from the outreach template. Must add new information not in the initial message (company news, team detail, technical challenge, growth data)\n**Personalization required:** Reference a different aspect of their profile than Touch 1\n**Send time:** Monday-Wednesday, 10 AM - 12 PM candidate's local time\n**Tracking:** Log follow-up attempt and note any profile changes or activity observed\n\n### Touch 3: Respectful Close (Day 8)\n**Channel:** Same channel as previous touches\n**Content:** Follow-up 2 from the outreach template. Graceful close that leaves the door open\n**Tone:** Warm, brief, no pressure. Acknowledge they may not be interested or the timing may be off\n**Send time:** Any weekday, morning\n**Tracking:** Log final attempt and set a 90-day reminder to re-engage if the role is still open\n\n### Escalation Rules\n- **If they respond positively at any touch:** Move to scheduling immediately. Respond within 2 hours during business hours\n- **If they respond with questions:** Answer directly and propose a call. Do not send the next automated touch\n- **If they respond negatively:** Thank them, mark as \"not interested\" with date, do not contact for this role again\n- **If no response after Touch 3:** Mark as \"no response\" and add to 90-day re-engagement list\n\n### When to Stop\n- Candidate explicitly declines\n- Candidate has been contacted for 3 different roles in the past 6 months\n- Candidate's profile indicates they have changed roles (just started a new position)\n- You receive a connection request rejection or InMail block",
    "usageCount": 31
  },
  {
    "id": "auto-hm-update",
    "title": "HM Update Draft Template",
    "description": "Standard weekly hiring manager update format.",
    "category": "automation",
    "stage": 7,
    "stageLabel": "Stage 7: Submission & HM Prep",
    "createdBy": "AI Hub Team",
    "lastUpdated": "2025-02-01",
    "content": "## Weekly Hiring Manager Update\n\n### Role Status\n**Role:** [Role Title]\n**Status:** Active / On Hold / Closing\n**Days Open:** [Number]\n**Target Fill Date:** [Date]\n**On Track:** Yes / At Risk / Behind -- [one-line reason if not on track]\n\n### Pipeline Summary\n| Stage | Count | Change |\n|-------|-------|--------|\n| Sourced | [X] | [+/-Y this week] |\n| Contacted | [X] | [+/-Y this week] |\n| Responded | [X] | [+/-Y this week] |\n| Screened | [X] | [+/-Y this week] |\n| Submitted | [X] | [+/-Y this week] |\n| Interviewing | [X] | [+/-Y this week] |\n\n### Actions Taken This Week\n- [Action 1: e.g., \"Sourced 25 new candidates from Lane 2 (adjacent industries)\"]\n- [Action 2: e.g., \"Completed 4 Truth Check screens, 2 advancing to submission\"]\n- [Action 3: e.g., \"Sent follow-up outreach to 12 candidates from initial batch\"]\n- [Action 4: e.g., \"Updated sourcing plan based on candidate feedback on comp range\"]\n\n### Candidates to Discuss\n- **[Candidate A]:** [One-line summary and recommended action]\n- **[Candidate B]:** [One-line summary and recommended action]\n\n### Blockers\n- [Blocker 1: e.g., \"Response rate below target (8% vs 15% benchmark). Likely cause: comp range positioning. See Trade-off recommendation below.\"]\n- [Blocker 2: e.g., \"Interview scheduling delays -- 3 candidates waiting 5+ days for panel availability.\"]\n\n### Recommended Next Steps\n1. [Specific action with owner and deadline]\n2. [Specific action with owner and deadline]\n3. [Specific action with owner and deadline]\n\n### Key Decision Needed\n[If applicable: a specific decision you need from the HM this week. Frame the options clearly.]\n- **Option A:** [Description + expected outcome]\n- **Option B:** [Description + expected outcome]\n- **Recommendation:** [Your recommendation and why]",
    "usageCount": 27
  }
]